from string import Template

#### RAG PROMPTS (ARABIC) ####

### System ###

system_prompt = Template("\n".join([
    "أنت مساعد ذكي مهمتك الإجابة على استفسارات المستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المتعلقة بسؤال المستخدم.",
    "يجب عليك صياغة الإجابة بناءً فقط على المستندات المقدمة.",
    "تجاهل المستندات التي لا علاقة لها بسؤال المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تكن المعلومات المتاحة كافية للإجابة.",
    "يجب أن تكون إجابتك بنفس لغة استفسار المستخدم (العربية).",
    "كن مهذباً ومحترماً في ردك.",
    "كن دقيقاً وموجزاً. تجنب حشو الكلام والمعلومات غير الضرورية."
]))


### Document ###

document_prompt = Template("\n".join([
    "## رقم المستند: $doc_num",
    "## المحتوى: $chunk_text",
]))

### Footer ###

footer_prompt = Template("\n".join([
    "استناداً إلى المستندات المذكورة أعلاه فقط، يرجى كتابة إجابة للمستخدم.",
    "## الإجابة:",
]))